app/controllers/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Listen to 5th Symphony"], ["done", "f"], ["todo_id", 5], ["created_at", "2018-03-30 13:04:21.490864"], ["updated_at", "2018-03-30 13:04:21.490864"]]
---
  def create
    @todo.items.create!(item_params)

UPDATE "items" SET "done" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["done", "t"], ["updated_at", "2018-03-30 13:05:37.627060"], ["id", 1]]
---
  def update
    @item.update(item_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.find(params[:todo_id])

SELECT  "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 5], ["id", 1], ["LIMIT", 1]]
---
  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo