app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "mozart"], ["created_by", "1"], ["created_at", "2018-03-29 13:08:34.195720"], ["updated_at", "2018-03-29 13:08:34.195720"]]
---
  def create
    @todo = Todo.create!(todo_params)

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Yiruma"], ["updated_at", "2018-03-29 13:39:58.727710"], ["id", 4]]
---
  def update
    @todo.update(todo_params)